Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: If you do that, MockFoo::Concrete() will be called (and cause an infinite recursion) since Foo::Concrete() is virtual.
it_it: Se lo si fa, verrà chiamato MockFoo::Concrete() (provocando una ricorsione infinita) in quanto Foo::Concrete() è virtuale.

source: If you do that, `MockFoo::Concrete()` will be called (and cause an infinite recursion) since `Foo::Concrete()` is virtual.
it_it: Se lo si fa, verrà chiamato `MockFoo::Concrete()` (provocando una ricorsione infinita) in quanto `Foo::Concrete()` è virtuale.

source: If you do that, make sure non_copyable_value is not changed afterwards, or the meaning of your matcher will be changed.
it_it: Se lo si fa, non_copyable_value non deve essere modificato in seguito, altrimenti il significato del matcher verrà cambiato.

source: If you do that, make sure `non_copyable_value` is not changed afterwards, or the meaning of your matcher will be changed.
it_it: Se lo si fa, `non_copyable_value` non deve essere modificato in seguito, altrimenti il significato del matcher verrà cambiato.

source: If you don't already have Bazel installed, see the Bazel installation guide.
it_it: Se Bazel non è ancora installato, consultare la Bazel installation guide.

source: If you don't already have Bazel installed, see the [Bazel installation guide](https://bazel.build/install).
it_it: Se Bazel non è ancora installato, consultare la [Bazel installation guide](https://bazel.build/install).

source: If you don't already have CMake installed, see the CMake installation guide.
it_it: Se CMake non è ancora installato, consultare la CMake installation guide.

source: If you don't already have CMake installed, see the [CMake installation guide](https://cmake.org/install).
it_it: Se Bazel non è ancora installato, consultare la [CMake installation guide](https://cmake.org/install).

source: If you don't care about *any* arguments, rather than specify `_` for each of them you may instead omit the parameter list:
it_it: Se non interessa *qualsiasi* argomento, anziché specificare `_` per ciascuno di essi si può omettere l'elenco dei parametri:

source: If you don't care about any arguments, rather than specify _ for each of them you may instead omit the parameter list:
it_it: Se non interessa qualsiasi argomento, anziché specificare _ per ciascuno di essi si può omettere l'elenco dei parametri:

source: If you don't say anything, this behavior will be used.
it_it: Se non si dice nulla, verrà utilizzato questo comportamento.

source: If you ever hit that limit... well, your callback has bigger problems than being mockable.
it_it: Se mai si raggiungesse questo limite... beh, la richiamata ha problemi più grandi del poter essere mock.

source: If you expect a call to change the behavior of a mock object, you can use ::testing::InSequence to specify different behaviors before and after the call:
it_it: Se si prevede che una chiamata modifichi il comportamento di un oggetto mock, si può usare ::testing::InSequence per specificare comportamenti diversi prima e dopo la chiamata:

source: If you expect a call to change the behavior of a mock object, you can use `::testing::InSequence` to specify different behaviors before and after the call:
it_it: Se si prevede che una chiamata modifichi il comportamento di un oggetto mock, si può usare `::testing::InSequence` per specificare comportamenti diversi prima e dopo la chiamata:

source: If you expect an overloaded function to be called, the compiler may need some help on which overloaded version it is.
it_it: Se ci si aspetta che venga chiamata una funzione overloaded, il compilatore potrebbe aver bisogno di aiuto sulla scelta della versione.

source: If you experience this and think that mocks suck, you are just not using the right tool for your problem.
it_it: Se ci si trova in questo caso e si pensa che i mock facciano schifo, semplicemente non si sta usando lo strumento giusto per il problema.

source: If you explicitly declare a non-default constructor for class FooTest (DISALLOW_EVIL_CONSTRUCTORS() does this), then you need to define a default constructor, even if it would be empty.
it_it: Se si dichiara esplicitamente un costruttore non di default per la classe FooTest (DISALLOW_EVIL_CONSTRUCTORS() fa questo), allora si deve definire un costruttore di default, anche se vuoto.

source: If you explicitly declare a non-default constructor for class `FooTest` (`DISALLOW_EVIL_CONSTRUCTORS()` does this), then you need to define a default constructor, even if it would be empty.
it_it: Se si dichiara esplicitamente un costruttore non di default per la classe `FooTest` (`DISALLOW_EVIL_CONSTRUCTORS()` fa questo), allora si deve definire un costruttore di default, anche se vuoto.

source: If you find SafeMatcherCast<T>(m) too limiting, you can use a similar function MatcherCast<T>(m).
it_it: Se si ritiene la SafeMatcherCast<T>(m) troppo limitante, si può usare una funzione simile MatcherCast<T>(m).

source: If you find `SafeMatcherCast<T>(m)` too limiting, you can use a similar function `MatcherCast<T>(m)`.
it_it: Se si ritiene la `SafeMatcherCast<T>(m)` troppo limitante, si può usare una funzione simile `MatcherCast<T>(m)`.

source: If you find gMock printing too many stack frames with its informational or warning messages, remember that you can control their amount with the --gtest_stack_trace_depth=max_depth flag.
it_it: Se si trova che gMock stampa troppi stack frame con i suoi messaggi informativi o di warning, se ne può controllare la quantità con il flag --gtest_stack_trace_depth=max_depth.

source: If you find gMock printing too many stack frames with its informational or warning messages, remember that you can control their amount with the `--gtest_stack_trace_depth=max_depth` flag.
it_it: Se si trova che gMock stampa troppi stack frame con i suoi messaggi informativi o di warning, se ne può controllare la quantità con il flag `--gtest_stack_trace_depth=max_depth` flag.

source: If you find the default message generated by EXPECT_PRED* and EXPECT_TRUE unsatisfactory, or some arguments to your predicate do not support streaming to ostream, you can instead use predicate-formatter assertions to fully customize how the message is formatted.
it_it: Se si ritiene insoddisfacente il messaggio di default generato da EXPECT_PRED* e da EXPECT_TRUE o alcuni argomenti del predicato supportano lo streaming su ostream, si possono alternativamente utilizzare asserzioni predicato-formatter per personalizzare completamente la modalità di formattazione del messaggio.

source: If you find the default message generated by [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) and [`EXPECT_TRUE`](reference/assertions.md#EXPECT_TRUE) unsatisfactory, or some arguments to your predicate do not support streaming to `ostream`, you can instead use *predicate-formatter assertions* to *fully* customize how the message is formatted.
it_it: Se si ritiene insoddisfacente il messaggio di default generato da [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) e da [`EXPECT_TRUE`](reference/assertions.md#EXPECT_TRUE) o alcuni argomenti del predicato supportano lo streaming su `ostream`, si possono alternativamente utilizzare *predicate-formatter assertions* per personalizzare *completamente* la modalità di formattazione del messaggio.

source: If you find the output too noisy when debugging, just choose a less verbose level.
it_it: Se si ritiene che l'output sia troppo prolisso durante il debug, si sceglie semplicemente un livello meno dettagliato di verbosità.

source: If you find yourself needing to perform some action that's not supported by gMock directly, remember that you can define your own actions using MakeAction() or MakePolymorphicAction(), or you can write a stub function and invoke it using Invoke().
it_it: Se si deve eseguire qualche azione non supportata direttamente da gMock, ci si ricordi che si possono definire le proprie azioni utilizzando MakeAction() o MakePolymorphicAction(), oppure si può scrivere una funzione stub e invocarla utilizzando Invoke().

source: If you find yourself needing to perform some action that's not supported by gMock directly, remember that you can define your own actions using [`MakeAction()`](#NewMonoActions) or [`MakePolymorphicAction()`](#NewPolyActions), or you can write a stub function and invoke it using [`Invoke()`](#FunctionsAsActions).
it_it: Se si deve eseguire qualche azione non supportata direttamente da gMock, ci si ricordi che si possono definire le proprie azioni utilizzando [`MakeAction()`](#NewMonoActions) o [`MakePolymorphicAction()`](#NewPolyActions), oppure si può scrivere una funzione stub e invocarla utilizzando [`Invoke()`](#FunctionsAsActions).

source: If you find yourself writing two or more tests that operate on similar data, you can use a test fixture.
it_it: Se ci si ritrova a scrivere due o più test che operano su dati simili, si può usare una test fixture.

source: If you find yourself writing two or more tests that operate on similar data, you can use a *test fixture*.
it_it: Se ci si ritrova a scrivere due o più test che operano su dati simili, si può usare una *test fixture*.

source: If you follow the following simple rules, your mocks and threads can live happily together:
it_it: Seguendo queste semplici regole, i mock e i thread possono convivere felicemente:

source: If you go with thread-safe death tests, remember that they rerun the test program from the beginning in the child process.
it_it: Se si usano i death test thread-safe, ricordarsi che eseguono nuovamente il programma di test dall'inizio nel processo figlio.

source: If you have a broken test that you cannot fix right away, you can add the DISABLED_ prefix to its name.
it_it: Se si ha un test non funzionante che non si può correggere subito, si può aggiungere il prefisso DISABLED_ al nome.

source: If you have a broken test that you cannot fix right away, you can add the `DISABLED_` prefix to its name.
it_it: Se si ha un test non funzionante che non si può correggere subito, si può aggiungere il prefisso `DISABLED_` al nome.

source: If you have a test suite where that omission is not an error, for example it is in a library that may be linked in for other reasons or where the list of test cases is dynamic and may be empty, then this check can be suppressed by tagging the test suite:
it_it: Se si dispone di una test suite in cui tale omissione non è un errore, ad esempio è in una libreria che potrebbe essere linkata per altri motivi o dove l'elenco dei casi di test è dinamico e potrebbe essere vuoto, allora questo controllo può essere soppresso taggando la test suite:

source: If you have an existing << operator and would like to define an AbslStringify(), the latter will be used for GoogleTest printing.
it_it: Se si dispone di un operatore << esistente e si vuol definire un AbslStringify(), quest'ultimo verrà utilizzato per la stampa di GoogleTest.

source: If you have an existing `<<` operator and would like to define an `AbslStringify()`, the latter will be used for GoogleTest printing.
it_it: Se si dispone di un operatore `<<` esistente e si vuol definire un `AbslStringify()`, quest'ultimo verrà utilizzato per la stampa di GoogleTest.

source: If you have defined both AbslStringify() and PrintTo(), the latter will be used by GoogleTest.
it_it: Se è stato definito sia AbslStringify() che PrintTo(), quest'ultimo verrà utilizzato da GoogleTest.

source: If you have defined both `AbslStringify()` and `PrintTo()`, the latter will be used by GoogleTest.
it_it: Se è stato definito sia `AbslStringify()` che `PrintTo()`, quest'ultimo verrà utilizzato da GoogleTest.

source: If you have more than one machine you can use to run a test program, you might want to run the test functions in parallel and get the result faster.
it_it: Disponendo di più di macchine su cui eseguire un programma di test, si potrebbero eseguire le funzioni di test in parallelo e ottenere il risultato più velocemente.

source: If you have some complex action that you want to use again and again, you may not have to build it from scratch every time.
it_it: Se si ha un'azione complessa che da utilizzare più e più volte, si potrebbe non doverla creare da zero ogni volta.

source: If you haven't yet, please read the dummy guide first to make sure you understand the basics.
it_it: Se non è stato ancora fatto, leggere prima la guida gMock per Principianti per capire le basi.

source: If you haven't yet, please read [the dummy guide](gmock_for_dummies.md) first to make sure you understand the basics.
it_it: Se non è stato ancora fatto, leggere prima la guida [gMock per Principianti](gmock_for_dummies.md) per capire le basi.

source: If you instead write:
it_it: Se invece si scrive:

source: If you just need to return a move-only value, you can use it in combination with WillOnce.
it_it: Se c'è solo da restituire un valore move-only, lo si può usare in combinazione con WillOnce.

source: If you just need to return a move-only value, you can use it in combination with `WillOnce`.
it_it: Se c'è solo da restituire un valore move-only, lo si può usare in combinazione con `WillOnce`.

source: If you look at the generated pkg-config file, it will look something like
it_it: Guardando il file pkg-config generato, sarà simile a

source: If you mock out the entire System class, you'll have to provide a fake implementation for the file operation part, which suggests that System is taking on too many roles.
it_it: Se si crea la mock di tutta la classe System, si dovrà fornire un'implementazione fake per la parte relativa alle operazioni sui file, il che suggerisce che System sta assumendo troppi ruoli.

source: If you mock out the entire `System` class, you'll have to provide a fake implementation for the file operation part, which suggests that `System` is taking on too many roles.
it_it: Se si crea la mock di tutta la classe `System`, si dovrà fornire un'implementazione fake per la parte relativa alle operazioni sui file, il che suggerisce che `System` sta assumendo troppi ruoli.

source: If you must mock such a class owned by others, define the mock class in Foo's Bazel package (usually the same directory or a testing sub-directory), and put it in a .h and a cc_library with testonly=True.
it_it: Per mock-are una classe simile di altri, si definisce la classe mock nel pacchetto Bazel di Foo (di solito la stessa directory o una sottodirectory di testing) e la si inserisce in un .h e un cc_library con testonly=True.

source: If you must mock such a class owned by others, define the mock class in `Foo`'s Bazel package (usually the same directory or a `testing` sub-directory), and put it in a `.h` and a `cc_library` with `testonly=True`.
it_it: Per mock-are una classe simile di altri, si definisce la classe mock nel pacchetto Bazel di `Foo` (di solito la stessa directory o una sottodirectory di `testing`) e la si inserisce in un `.h` e un `cc_library` con `testonly=True`.

source: If you need a custom matcher but Truly() is not a good option (for example, you may not be happy with the way Truly(predicate) describes itself, or you may want your matcher to be polymorphic as Eq(value) is), you can define a matcher to do whatever you want in two steps: first implement the matcher interface, and then define a factory function to create a matcher instance.
it_it: Se c'è bisogno di un matcher personalizzato ma Truly() non è una buona opzione (ad esempio, non soddisfa il modo in cui Truly(predicate) si descrive, oppure per rendere il matcher polimorfico come lo è Eq(value)), si può definire un matcher in due passaggi: prima si implementa l'interfaccia del matcher e poi si definisce una funzione factory per creare un'istanza del matcher.

source: If you need a custom matcher but `Truly()` is not a good option (for example, you may not be happy with the way `Truly(predicate)` describes itself, or you may want your matcher to be polymorphic as `Eq(value)` is), you can define a matcher to do whatever you want in two steps: first implement the matcher interface, and then define a factory function to create a matcher instance.
it_it: Se c'è bisogno di un matcher personalizzato ma `Truly()` non è una buona opzione (ad esempio, non soddisfa il modo in cui `Truly(predicate)` si descrive, oppure per rendere il matcher polimorfico come lo è `Eq(value)`), si può definire un matcher in due passaggi: prima si implementa l'interfaccia del matcher e poi si definisce una funzione factory per creare un'istanza del matcher.

source: If you need to disable all tests in a test suite, you can either add DISABLED_ to the front of the name of each test, or alternatively add it to the front of the test suite name.
it_it: Per disabilitare tutti i test in una test suite, si può aggiungere DISABLED_ all'inizio del nome di ciascun test o in alternativa aggiungerlo all'inizio del nome della test suite.

source: If you need to disable all tests in a test suite, you can either add `DISABLED_` to the front of the name of each test, or alternatively add it to the front of the test suite name.
it_it: Per disabilitare tutti i test in una test suite, si può aggiungere `DISABLED_` all'inizio del nome di ciascun test o in alternativa aggiungerlo all'inizio del nome della test suite.

source: If you need to use fatal assertions in a function that returns non-void, one option is to make the function return the value in an out parameter instead.
it_it: Per usare asserzioni fatali in una funzione che restituisce non void, un'opzione è fare in modo che la funzione restituisca il valore in un parametro di output.

source: If you need to, you can rewrite your code to use an interface (abstract class).
it_it: Se necessario, si può riscrivere il codice per utilizzare un'interfaccia (classe astratta).

source: If you need your mock method to do more than just moving a pre-defined value, remember that you can always use a lambda or a callable object, which can do pretty much anything you want:
it_it: Se c'è bisogno che il metodo mock faccia qualcosa di più del semplice spostamento di un valore di default, ricordarsi che si può sempre utilizzare un oggetto lambda o un richiamabile [callable], che può fare praticamente tutto:

source: If you pass --gtest_repeat=2 --gtest_break_on_failure on the command line, the same test is repeated twice.
it_it: Passando --gtest_repeat=2 --gtest_break_on_failure sulla riga di comando, lo stesso test viene ripetuto due volte.

source: If you put the above code in a header file, you can `#include` it in multiple C++ source files and instantiate it multiple times.
it_it: Se si inserisce il codice precedente in un file header, si può `#include`-rlo in più sorgenti C++e istanziarlo più volte.

source: If you really need to see such LOG messages, a workaround is to temporarily break the death test (e.g. by changing the regex pattern it is expected to match).
it_it: Se c'è davvero bisogno di vedere tali messaggi di LOG, una soluzione alternativa è quella di interrompere temporaneamente il death test (ad esempio modificando il pattern regex che dovrebbe corrispondere).

source: If you see the compiler complaining about you ignoring the return value of RUN_ALL_TESTS(), the fix is simple: just make sure its value is used as the return value of main().
it_it: Se il compilatore si lamenta del fatto che viene ignorato il valore restituito di RUN_ALL_TESTS(), la soluzione è semplice: si deve utilizzare il valore come valore restituito da main().

source: If you see the compiler complaining about you ignoring the return value of `RUN_ALL_TESTS()`, the fix is simple: just make sure its value is used as the return value of `main()`.
it_it: Se il compilatore si lamenta del fatto che viene ignorato il valore restituito di `RUN_ALL_TESTS()`, la soluzione è semplice: si deve utilizzare il valore come valore restituito da `main()`.

source: If you see the message "The mock function has no default action set, and its return type has no default value set.", then try adding a default action.
it_it: Se si vede il messaggio "The mock function has no default action set, and its return type has no default value set.", provare ad aggiungere un'azione di default.

source: If you see the message "The mock function has no default action set, and its return type has no default value set.", then try [adding a default action](gmock_cheat_sheet.md#OnCall).
it_it: Se si vede il messaggio "The mock function has no default action set, and its return type has no default value set.", provare ad [aggiungere un'azione di default](gmock_cheat_sheet.md#OnCall).

source: If you set
it_it: Se si imposta

source: If you set the GTEST_FILTER environment variable or the --gtest_filter flag to a filter string, GoogleTest will only run the tests whose full names (in the form of TestSuiteName.TestName) match the filter.
it_it: Se imposti la variabile di ambiente GTEST_FILTER o il flag --gtest_filter su una stringa di filtro, GoogleTest eseguirà solo i test i cui nomi completi (nel formato TestSuiteName.TestName) corrisponderanno al filtro.

source: If you set the `GTEST_FILTER` environment variable or the `--gtest_filter` flag to a filter string, GoogleTest will only run the tests whose full names (in the form of `TestSuiteName.TestName`) match the filter.
it_it: Se si imposta la variabile di ambiente `GTEST_FILTER` o il flag `--gtest_filter` su una stringa di filtro, GoogleTest eseguirà solo i test i cui nomi completi (nel formato `TestSuiteName.TestName`) corrisponderanno al filtro.

source: If you set the expectations too strict, your test will fail as the result of unrelated changes.
it_it: Con delle expectation troppo rigide, il test fallirà per modifiche non correlate.

source: If you set them too loose, bugs can slip through.
it_it: Se sono troppo blande, qualche bug potrebbe sfuggire.

source: If you specify "" as the description, the failure message will contain the sequence of words in the matcher name followed by the parameter values printed as a tuple.
it_it: Specificando "" come descrizione, il messaggio di errore conterrà la sequenza di parole nel nome del matcher seguita dai valori dei parametri stampati come una tupla.

source: If you specify `""` as the description, the failure message will contain the sequence of words in the matcher name followed by the parameter values printed as a tuple.
it_it: Specificando `""` come descrizione, il messaggio di errore conterrà la sequenza di parole nel nome del matcher seguita dai valori dei parametri stampati come una tupla.

source: If you specify a directory (for example, "xml:output/directory/" on Linux or "xml:output\directory\" on Windows), GoogleTest will create the XML file in that directory, named after the test executable (e.g. foo_test.xml for test program foo_test or foo_test.exe).
it_it: Specificando una directory (per esempio, "xml:output/directory/" su Linux o "xml:output\directory\" su Windows), GoogleTest creerà il file XML in tale directory, che prende il nome dall'eseguibile del test (ad esempio foo_test.xml per il programma di test foo_test o foo_test.exe).

source: If you specify a directory (for example, `"xml:output/directory/"` on Linux or `"xml:output\directory\"` on Windows), GoogleTest will create the XML file in that directory, named after the test executable (e.g. `foo_test.xml` for test program `foo_test` or `foo_test.exe`).
it_it: Specificando una directory (per esempio, `"xml:output/directory/"` su Linux o `"xml:output\directory\"` su Windows), GoogleTest creerà il file XML in tale directory, che prende il nome dall'eseguibile del test (ad esempio `foo_test.xml` per il programma di test `foo_test` o `foo_test.exe`).
